Repository: red-Geck0/OmniConsoleMod
Catalog: OmniConsole/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn, zh_tw

# StatusText.Text
source: Launching...
zh_cn: 正在启动...
zh_tw: 正在啟動...

# SettingsTitle.Text
source: OmniConsoleMod Settings
zh_cn: OmniConsoleMod 设置
zh_tw: OmniConsole 設定

# SettingsDescription
source: OmniConsoleMod platform: {0}
zh_cn: 默认平台：{0}
zh_tw: 預設平台：{0}

# Launching
source: Launching {0}...
zh_cn: 正在启动“{0}”...
zh_tw: 正在啟動「{0}」...

# LaunchSuccess
source: {0} launched
zh_cn: “{0}”已启动
zh_tw: 「{0}」已啟動

# LaunchSlowWarningText.Text
source: The platform is taking longer than expected and may still be loading. Please wait. If needed, press and hold the Xbox button to open Task View and check if the platform is running.
zh_cn: 平台启动时间比预期长，可能仍在初始化中，请耐心等候。如有需要，可长按 Xbox 键打开任务视图确认平台状态。
zh_tw: 平台啟動時間比預期長，可能仍在初始化中，請耐心等候。如有需要，可長按 Xbox 鍵開啟工作檢視確認平台狀態。

# LaunchTimeout
source: Launch timed out. Please verify {0} is running normally.
zh_cn: 启动等待超时，请确认“{0}”运行正常
zh_tw: 啟動等待逾時，請確認「{0}」運作正常

# LaunchFailed
source: Unable to launch {0}. Please ensure the app can be launched and check its installation or settings.
zh_cn: 无法启动“{0}”。请确认该应用程序可正常运行，并检查其安装状态或设置。
zh_tw: 無法啟動「{0}」。請確認該應用程式可正常執行，並檢查其安裝狀態或設定。

# OpenSettingsButton.Content
source: Open Settings
zh_cn: 打开设置
zh_tw: 開啟設定

# ReturnToDesktopButton.Content
source: Return to Desktop
zh_cn: 返回桌面
zh_tw: 返回桌面

# FseNotAvailable
source: Xbox Mode (FSE) is not enabled. Please enable it first, then manually restart OmniConsole.
zh_cn: Xbox 模式 (FSE) 尚未启用，请先启用后手动重启 OmniConsole。
zh_tw: Xbox 模式 (FSE) 尚未啟用，請先啟用後手動重啟 OmniConsole。

# FseHandheldRequired
source: Limited PC Xbox Mode (FSE) detected, but OmniConsole requires the Full Handheld edition. Please enable it with Xbox Full Screen Experience Tool, then manually restart OmniConsole.
zh_cn: 检测到 PC 限制版 Xbox 模式 (FSE)，但 OmniConsole 需要掌机完整版。请使用 Xbox Full Screen Experience Tool 启用后，手动重启 OmniConsole。
zh_tw: 偵測到 PC 限制版 Xbox 模式 (FSE)，但 OmniConsole 需要掌機完整版。請使用 Xbox Full Screen Experience Tool 啟用後，手動重啟 OmniConsole。

# FseHomeAppNotSet
source: Please go to Windows Settings → Gaming → Xbox mode (FSE) and select OmniConsole from the “Choose home app” dropdown, then manually restart OmniConsole.
zh_cn: 请前往 Windows 设置 → 游戏 → Xbox 模式 (FSE)，在“选择主应用”中指定 OmniConsole，完成后手动重启 OmniConsole。
zh_tw: 請前往 Windows 設定 → 遊戲 → Xbox 模式 (FSE)，在「選擇主畫面應用程式」中指定 OmniConsole，完成後手動重啟 OmniConsole。

# EnableFseButton.Content
source: Enable Xbox Mode (FSE)
zh_cn: 启用 Xbox 模式 (FSE)
zh_tw: 啟用 Xbox 模式 (FSE)

# OpenFseSettingsButton.Content
source: Set OmniConsole as Home App
zh_cn: 将 OmniConsole 设为主应用
zh_tw: 將 OmniConsole 設為主畫面應用程式

# AppDescription
source: Custom Windows 11 Xbox Mode (FSE) Home shell for gaming PCs and handhelds.
zh_cn: 为游戏 PC 与掌机设计的自定义 Windows 11 Xbox 模式 (FSE) 主页 Shell。
zh_tw: 為遊戲 PC 與掌機設計的自訂 Windows 11 Xbox 模式 (FSE) 首頁 Shell。

# AppExtensionDescription
source: Custom Home Shell for Windows Xbox Mode (FSE).
zh_cn: 为 Windows Xbox 模式 (FSE) 设计的自定义主页 Shell。
zh_tw: 為 Windows Xbox 模式 (FSE) 設計的自訂首頁 Shell。

# SettingsAppDisplayName
source: OmniConsoleMod Settings
zh_cn: OmniConsoleMod 设置
zh_tw: OmniConsole 設定

# SettingsAppDescription
source: Configure default gaming platform, Game Bar behavior, and custom launch targets.
zh_cn: 设置默认游戏平台、Game Bar 行为与自定义启动目标。
zh_tw: 設定預設遊戲平台、Game Bar 行為與自訂啟動目標。

# ResetGameBarButton.Content
source: Run
zh_cn: 执行
zh_tw: 執行

# Nav_General.Content
source: General
zh_cn: 常规
zh_tw: 一般

# Nav_Troubleshoot.Content
source: Troubleshoot
zh_cn: 疑难解答
zh_tw: 疑難排解

# TroubleshootDescription.Text
source: Diagnose and fix common issues.
zh_cn: 诊断并修复常见问题。
zh_tw: 診斷並修正常見問題。

# TroubleshootTitle.Text
source: Troubleshoot
zh_cn: 疑难解答
zh_tw: 疑難排解

# TroubleshootSection_Fse.Text
source: Xbox Mode (FSE)
zh_cn: Xbox 模式 (FSE)
zh_tw: Xbox 模式 (FSE)

# ResetGameBarSetting_Title.Text
source: Restart Game Bar & Enter Xbox Mode (FSE)
zh_cn: 重启 Game Bar 并进入 Xbox 模式 (FSE)
zh_tw: 重啟 Game Bar 並進入 Xbox 模式 (FSE)

# ResetGameBarSetting_Description.Text
source: Restart Game Bar to fix issues such as Game Bar not opening, or the “Restart for better performance” dialog not appearing when entering Xbox Mode (FSE).
zh_cn: 重启 Game Bar，以修复 Game Bar 无法打开、或进入 Xbox 模式 (FSE) 时未显示“重启以提高性能”对话框等问题。
zh_tw: 重啟 Game Bar，以修復 Game Bar 無法開啟、或進入 Xbox 模式 (FSE) 時未顯示「重新啟動以提升效能」對話方塊等問題。

# ResetGameBarSetting_Note.Text
source: On some Windows versions, a confirmation dialog may still appear.
zh_cn: 部分 Windows 版本仍可能显示确认对话框。
zh_tw: 部分 Windows 版本仍可能顯示確認對話方塊。

# UseGameBarLibrarySwitch.OffContent
source: Platform
zh_cn: 游戏平台
zh_tw: 遊戲平台

# UseGameBarLibrarySwitch.OnContent
source: Settings
zh_cn: 设置界面
zh_tw: 設定介面

# Nav_Advanced.Content
source: Advanced
zh_cn: 高级
zh_tw: 進階

# AdvancedTitle.Text
source: Advanced Settings
zh_cn: 高级设置
zh_tw: 進階設定

# AdvancedDescription.Text
source: Fine-tune system behavior and integration options.
zh_cn: 微调系统行为与集成选项。
zh_tw: 微調系統行為與整合選項。

# AdvancedSection_GamepadInput.Text
source: Gamepad Input
zh_cn: 手柄输入
zh_tw: 手把輸入

# PhantomKeySetting_Title.Text
source: Gamepad Input Service
zh_cn: 手柄输入服务
zh_tw: 手把輸入服務

# PhantomKeySetting_Description.Text
source: Press  to open Steam’s menus in Steam Big Picture mode.
zh_cn: 在 Steam Big Picture 模式中按  打开 Steam 菜单。
zh_tw: 在 Steam Big Picture 模式中按  開啟 Steam 選單。

# PhantomKeySetting_Note.Text
source: Short press  to open Steam Menu, long press  to open Quick Access Menu.
zh_cn: 短按  打开 Steam 菜单，长按  打开快速访问菜单。
zh_tw: 短按  開啟 Steam 選單，長按  開啟快速存取選單。

# SteamInGameOverlaySetting_Title.Text
source: Long Press  to Open Steam In-Game Overlay
zh_cn: 长按  打开 Steam 游戏叠加界面
zh_tw: 長按  開啟 Steam 遊戲內嵌介面

# SteamInGameOverlaySetting_Description.Text
source: Requires Steam In-Game Overlay to be enabled.
zh_cn: 需要在 Steam 中启用游戏叠加界面。
zh_tw: 需要在 Steam 中啟用遊戲內嵌介面。

# SteamInGameOverlaySetting_Note.Text
source: Only available when the default platform is set to Steam Big Picture.
zh_cn: 仅在默认平台设为 Steam Big Picture 时生效。
zh_tw: 僅在預設平台設為 Steam Big Picture 時生效。

# SteamInGameOverlaySetting_ModifierNote.Text
source: Long press  to close the overlay and prevent modifier keys (e.g. Shift, Ctrl, Alt) from getting stuck in-game. Alternatively, change the shortcut to a non-modifier key in Steam Settings > In Game > Overlay shortcut key(s).
zh_cn: 长按  关闭叠加界面，避免修饰键（如 Shift、Ctrl、Alt）卡住游戏。 或至 Steam 设置 > 游戏中 > 叠加界面快捷键，改为非修饰键。
zh_tw: 長按  關閉內嵌介面，避免修飾鍵（如 Shift、Ctrl、Alt）卡住遊戲。 或至 Steam 設定 > 遊戲中 > 內嵌介面快捷鍵，改為非修飾鍵。

# MouseModeSetting_Title.Text
source: Gamepad Mouse Mode
zh_cn: 手柄鼠标模式
zh_tw: 手把滑鼠模式

# MouseModeSetting_Description.Text
source: Enable mapping gamepad inputs into mouse or keyboard. Apps will use the default profile (see Nekomata page) unless specified on the OmniCharm Game Bar widget.
zh_cn: 启用将手柄输入映射为鼠标或键盘。应用将使用默认配置方案（见猫又页），除非在 OmniCharm Game Bar 小工具上另行指定。
zh_tw: 啟用將手把輸入映射為滑鼠或鍵盤。應用程式將使用預設設定檔（見貓又頁），除非在 OmniCharm Game Bar 小工具上另行指定。

# MouseModeItem_Off.Content
source: Off
zh_cn: 关闭
zh_tw: 關閉

# MouseModeItem_Auto.Content
source: Auto
zh_cn: 自动
zh_tw: 自動

# MouseModeItem_ForceOn.Content
source: Force On
zh_cn: 强制开启
zh_tw: 強制開啟

# MouseModeSetting_Note.Text
source: When set to Auto, supports Edge, Chrome, Firefox, Opera, Brave, Epic Games Store, File Explorer, Steam, and Discord.
zh_cn: 设为自动时，支持 Edge、Chrome、Firefox、Opera、Brave、Epic Games Store、文件资源管理器、Steam 和 Discord。
zh_tw: 設為自動時，支援 Edge、Chrome、Firefox、Opera、Brave、Epic Games Store、檔案總管、Steam 和 Discord。

# MouseModeSetting_BuiltInMappingNote.Text
source: Disabled — device has built-in gamepad mapping.
zh_cn: 已禁用 — 设备具备内置手柄映射。
zh_tw: 已停用 — 裝置具備內建手把映射。

# MouseModeLayoutSetting_Title.Text
source: Controller Layout
zh_cn: 控制器布局
zh_tw: 控制器版面配置

# MouseModeLayoutSetting_Description.Text
source: OmniNav: left stick moves the cursor. Classic: right stick moves the cursor.
zh_cn: OmniNav：左摇杆控制光标。Classic：右摇杆控制光标。
zh_tw: OmniNav：左搖桿控制游標。Classic：右搖桿控制游標。

# CursorSpeedSetting_Title.Text
source: Cursor Speed
zh_cn: 光标速度
zh_tw: 游標速度

# CursorSpeedSetting_Description.Text
source: Scale cursor movement speed relative to the default (100%).
zh_cn: 相对于默认值（100%）缩放光标移动速度。
zh_tw: 相對於預設值（100%）縮放游標移動速度。

# GameBarLibrarySetting_Title.Text
source: Library Button Opens Settings
zh_cn: 库按钮打开设置
zh_tw: 媒體櫃按鈕開啟設定

# GameBarLibrarySetting_Description.Text
source: Choose the action for the “Library” button in Game Bar.
zh_cn: 选择 Game Bar 中”库”按钮的操作。
zh_tw: 選擇 Game Bar 中「媒體櫃」按鈕的動作。

# PassthroughSetting_Title.Text
source: Direct to Platform
zh_cn: 直接导向平台
zh_tw: 直接導向平台

# PassthroughSetting_Description.Text
source: Navigate “Home” and “Library” directly to the default platform instead of OmniConsole.
zh_cn: “主页”和“库”按钮将直接导向默认平台，跳过 OmniConsole。
zh_tw: 「首頁」和「媒體櫃」按鈕將直接導向預設平台，跳過 OmniConsole。

# PassthroughSetting_Note.Text
source: Currently only supports Xbox App. “Library” button setting above takes priority.
zh_cn: 目前仅支持 Xbox App。库按钮以上方设置为优先。
zh_tw: 目前僅支援 Xbox App。媒體櫃按鈕以上方設定為優先。

# EnablePassthroughSwitch.OffContent
source: Normal
zh_cn: 正常流程
zh_tw: 正常流程

# EnablePassthroughSwitch.OnContent
source: Direct
zh_cn: 直接导向
zh_tw: 直接導向

# GamepadHint_Select.Text
source: Select
zh_cn: 选择
zh_tw: 選取

# GamepadHint_Exit.Text
source: Exit
zh_cn: 退出
zh_tw: 退出

# GamepadHint_OpenMenu.Text
source: Open Menu
zh_cn: 打开菜单
zh_tw: 開啟選單

# AddPlatformText.Text
source: Add
zh_cn: 添加
zh_tw: 新增

# GamepadHint_Edit.Text
source: Edit
zh_cn: 编辑
zh_tw: 編輯

# GamepadHint_Launch.Text
source: Set & launch
zh_cn: 设为默认并启动
zh_tw: 設為預設並啟動

# PlatformDialog_AddTitle
source: Add Platform
zh_cn: 添加平台
zh_tw: 新增平台

# PlatformDialog_EditTitle
source: Edit Platform
zh_cn: 编辑平台
zh_tw: 編輯平台

# PlatformDialog_NameLabel
source: Name
zh_cn: 名称
zh_tw: 名稱

# PlatformDialog_NamePlaceholder
source: e.g. My Gaming Platform
zh_cn: 例如 My Gaming Platform
zh_tw: 例如 My Gaming Platform

# PlatformDialog_LaunchTypeLabel
source: Launch Type
zh_cn: 启动方式
zh_tw: 啟動方式

# PlatformDialog_Executable
source: Executable
zh_cn: 可执行文件
zh_tw: 執行檔

# PlatformDialog_UriPlaceholder
source: e.g. steam://open/bigpicture
zh_cn: 例如 steam://open/bigpicture
zh_tw: 例如 steam://open/bigpicture

# PlatformDialog_PathLabel
source: Path
zh_cn: 路径
zh_tw: 路徑

# PlatformDialog_PathPlaceholder
source: e.g. C:\Program Files (x86)\Steam\steam.exe
zh_cn: 例如 C:\Program Files (x86)\Steam\steam.exe
zh_tw: 例如 C:\Program Files (x86)\Steam\steam.exe

# PlatformDialog_IconLabel
source: Card Cover (optional)
zh_cn: 卡片封面图（可选）
zh_tw: 卡片封面圖（選填）

# PlatformDialog_IconHint
source: Recommended: 800 x 560 px (10:7)
zh_cn: 建议尺寸：800 x 560 px（10:7）
zh_tw: 建議尺寸：800 x 560 px（10:7）

# PlatformDialog_ConfigWarning
source: Caution: Incorrect configuration may cause platform launch failure or unexpected behavior.
zh_cn: 注意：配置不正确可能导致平台启动失败或产生非预期的行为。
zh_tw: 注意：配置不正確可能導致平台啟動失敗或產生非預期的行為。

# PlatformDialog_ValidationNameTooLong
source: Name must not exceed 50 characters.
zh_cn: 名称不可超过 50 个字符。
zh_tw: 名稱不可超過 50 個字元。

# PlatformDialog_ValidationNameInvalid
source: Name contains invalid characters.
zh_cn: 名称包含无效字符。
zh_tw: 名稱包含不合法的字元。

# PlatformDialog_ValidationTargetEmpty
source: This field is required.
zh_cn: 此为必填项。
zh_tw: 此為必填欄位。

# PlatformDialog_ValidationUriInvalid
source: Invalid URI format. Example: steam://open/bigpicture
zh_cn: URI 格式无效。例如 steam://open/bigpicture
zh_tw: URI 格式無效。例如 steam://open/bigpicture

# PlatformDialog_ValidationUriNotSupported
source: No application is registered to handle this URI scheme.
zh_cn: 系统没有已注册的应用程序可处理此 URI 方案。
zh_tw: 系統沒有已登錄的應用程式可處理此 URI 配置。

# PlatformDialog_ValidationUriSelf
source: Cannot add OmniConsole itself as a platform; this would cause a restart loop.
zh_cn: 无法将 OmniConsole 自身添加为平台，这会导致循环重新启动。
zh_tw: 無法將 OmniConsole 自身加為平台，這會導致循環重新啟動。

# PlatformDialog_ValidationPathInvalid
source: Invalid file path. Example: C:\Program Files (x86)\Steam\steam.exe
zh_cn: 路径格式无效。例如 C:\Program Files (x86)\Steam\steam.exe
zh_tw: 路徑格式無效。例如 C:\Program Files (x86)\Steam\steam.exe

# PlatformDialog_ValidationPathConsoleApp
source: Console applications are not supported. They may cause Xbox Mode (FSE) to restart in a loop.
zh_cn: 不支持控制台应用程序，可能导致 Xbox 模式 (FSE) 循环重新启动。
zh_tw: 不支援主控台應用程式，可能導致 Xbox 模式 (FSE) 循環重新啟動。

# PlatformDialog_ValidationArgsInvalid
source: Arguments contain potentially unsafe characters.
zh_cn: 启动参数包含不安全的字符。
zh_tw: 啟動參數包含不安全的字元。

# PlatformCard_AddCustom.Text
source: Add Custom Platform
zh_cn: 添加自定义平台

# CustomPlatform_ConsentTitle
source: Custom Platform Support (Experimental)
zh_cn: 自定义平台支持（实验性功能）

# CustomPlatform_ConsentBody.Text
source: This feature allows you to add custom platform launch configurations. Please read the following carefully before proceeding: - The software is provided “as-is”, without warranty of any kind, express or implied; this feature is experimental and provided with no assurances whatsoever. - Incorrectly configured platforms may fail to launch, which could crash the Xbox Mode (FSE) environment or even require an app reset to recover. - The developer assumes no responsibility or liability for any damage, data loss, or issues arising from the use of this program or custom platform configurations. - You are solely responsible for ensuring the safety, correctness, and legitimacy of all configurations you create. By clicking “I Understand and Accept”, you acknowledge these risks and agree to use this feature entirely at your own discretion and responsibility.
zh_cn: 此功能允许您自行添加自定义平台启动配置。请在继续之前仔细阅读以下内容： - 本软件按“现状”提供，不提供明示或默示的担保；此自定义功能为实验性质，更不提供任何保证。 - 配置错误的平台可能无法正常启动，进而导致 Xbox 模式 (FSE) 环境崩溃，甚至必须重置应用程序才能恢复正常。 - 开发者不对因使用本程序或自定义平台配置所造成的任何损害、数据丢失或其他问题承担责任。 - 您需自行确保所有配置的安全性、正确性及合法性。 点击“我了解并接受”即表示您已充分了解上述风险，并同意完全自行斟酌决定，承担使用此功能的一切责任与后果。
zh_tw: 此功能允許您自行新增自訂平台啟動配置。請在繼續之前仔細閱讀以下內容： - 本軟體按「現狀」提供，不提供明示或默示的擔保；此自訂功能為實驗性質，更不提供任何保證。 - 配置錯誤的平台可能無法正常啟動，進而導致 Xbox 模式 (FSE) 環境崩潰，甚至必須重設應用程式才能恢復正常。 - 開發者不對因使用本程式或自訂平台配置所造成的任何損害、資料遺失或其他問題承擔責任。 - 您需自行確保所有配置的安全性、正確性及合法性。 點選「我了解並接受」即表示您已充分了解上述風險，並同意完全自行斟酌決定，承擔使用此功能的一切責任與後果。

# CustomPlatform_ConsentAccept
source: I Understand and Accept
zh_cn: 我了解并接受

# PlatformDialog_ArgsLabel
source: Arguments (optional)
zh_cn: 启动参数（可选）
zh_tw: 啟動參數（選填）

# PlatformDialog_ArgsPlaceholder
source: e.g. -bigpicture
zh_cn: 例如 -bigpicture
zh_tw: 例如 -bigpicture

# PlatformDialog_ValidationPathNotExe
source: Only executable files (.exe) are supported.
zh_cn: 仅支持可执行文件（.exe）。
zh_tw: 僅支援執行檔（.exe）。

# PlatformDialog_ValidationArgsTooLong
source: Arguments must not exceed 500 characters.
zh_cn: 启动参数不可超过 500 个字符。
zh_tw: 啟動參數不可超過 500 個字元。

# PlatformNotAvailable
source: {0} is not available. Please verify it is installed or choose a different platform.
zh_cn: “{0}”无法使用，请确认已安装或选择其他平台。
zh_tw: 「{0}」無法使用，請確認已安裝或選擇其他平台。

# PlatformDialog_ValidationUriTooLong
source: URI must not exceed 2048 characters.
zh_cn: URI 不可超过 2048 个字符。
zh_tw: URI 不可超過 2048 個字元。

# PlatformDialog_ValidationPathTooLong
source: Path must not exceed 260 characters.
zh_cn: 路径不可超过 260 个字符。
zh_tw: 路徑不可超過 260 個字元。

# PlatformDialog_Save
source: Save
zh_cn: 保存
zh_tw: 儲存

# PlatformDialog_Cancel
source: Cancel
zh_cn: 取消
zh_tw: 取消

# PlatformDialog_Delete
source: Delete
zh_cn: 删除
zh_tw: 刪除

# PlatformDialog_PackagedApp
source: Packaged App (MSIX / APPX)
zh_cn: 应用包 (MSIX / APPX)
zh_tw: 封裝套件 (MSIX / APPX)

# PlatformDialog_PackagedAppLabel
source: Package Family Name
zh_cn: 包系列名称
zh_tw: 套件系列名稱

# PlatformDialog_PackagedAppPlaceholder
source: Type to search installed packages...
zh_cn: 输入以搜索已安装的应用包...
zh_tw: 輸入以搜尋已安裝的套件...

# PlatformDialog_PackagedAppWarning
source: Caution: Not all packages support launching (e.g., extensions or background services). Ensure you select an app with a “user interface.”
zh_cn: 注意：并非所有应用包都支持启动（例如各种扩展组件或后台服务）。请确保选择的是具备“用户界面”的应用程序。
zh_tw: 注意：並非所有套件都支援啟動（例如各種延伸模組或背景服務）。請確保選取的是具備「使用者介面」的應用程式。

# PlatformDialog_ValidationPackagedAppEmpty
source: Please select a packaged app.
zh_cn: 请选择应用包。
zh_tw: 請選取封裝套件。

# PlatformDialog_ValidationPackagedAppSelf
source: Cannot add OmniConsole itself as a platform.
zh_cn: 无法将 OmniConsole 本身添加为平台。
zh_tw: 無法將 OmniConsole 本身加入為平台。

# PlatformDialog_ValidationPackagedAppGameBar
source: Cannot add Game Bar as a platform.
zh_cn: 无法将 Game Bar 添加为平台。
zh_tw: 無法將 Game Bar 加入為平台。

# PlatformDialog_ValidationPackagedAppNotAllowed
source: This package cannot be used as a platform (e.g., it may be an extension, service, or runtime component).
zh_cn: 此包无法作为平台使用（例如扩展、后台服务或运行时组件）。
zh_tw: 此套件無法作為平台使用（例如延伸模組、背景服務或執行時期元件）。

# CardMenu_Export.Text
source: Export
zh_cn: 导出
zh_tw: 匯出

# ImportPlatformDialog_Title
source: Import Platform
zh_cn: 导入平台
zh_tw: 匯入平台

# ImportPlatformDialog_Warning
source: Caution: Only import configurations from sources you trust. Malicious configurations could launch harmful programs.
zh_cn: 注意：请仅导入来自可信来源的配置。恶意配置可能启动有害程序。
zh_tw: 注意：請僅匯入來自信任來源的配置。惡意配置可能啟動有害的程式。

# ImportPlatformDialog_Placeholder
source: Paste JSON here... e.g. { "shell": "OmniConsole", "displayName": "Steam Big Picture", "launchType": "ProtocolUri", "launchTarget": "steam://open/bigpicture" }
zh_cn: 在此粘贴 JSON… 例如 { "shell": "OmniConsole", "displayName": "Steam Big Picture", "launchType": "ProtocolUri", "launchTarget": "steam://open/bigpicture" }
zh_tw: 在此貼上 JSON… 例如 { "shell": "OmniConsole", "displayName": "Steam Big Picture", "launchType": "ProtocolUri", "launchTarget": "steam://open/bigpicture" }

# ImportPlatformDialog_Primary
source: Import
zh_cn: 导入
zh_tw: 匯入

# Import_Error_EmptyJson
source: Please paste a JSON string.
zh_cn: 请粘贴 JSON 字符串。
zh_tw: 請貼上 JSON 字串。

# Import_Error_InvalidJson
source: The text is not valid JSON.
zh_cn: 内容不是有效的 JSON。
zh_tw: 內容不是有效的 JSON。

# Import_Error_MissingName
source: Display name is required.
zh_cn: 缺少显示名称。
zh_tw: 缺少顯示名稱。

# Import_Error_InvalidLaunchType
source: Unknown launch type.
zh_cn: 未知的启动类型。
zh_tw: 不明的啟動類型。

# Import_Error_MissingTarget
source: Launch target is required.
zh_cn: 缺少启动目标。
zh_tw: 缺少啟動目標。

# Import_Error_InvalidCharacters
source: Content contains invalid characters.
zh_cn: 内容含有无效字符。
zh_tw: 內容含有無效字元。

# Import_Error_InvalidUri
source: Invalid protocol URI format.
zh_cn: Protocol URI 格式无效。
zh_tw: Protocol URI 格式無效。

# Import_Error_UriNotSupported
source: No application is registered to handle this URI scheme.
zh_cn: 系统没有已注册的应用程序可处理此 URI 方案。
zh_tw: 系統沒有已登錄的應用程式可處理此 URI 配置。

# Import_Error_UriSelf
source: Cannot import OmniConsole itself as a platform.
zh_cn: 无法导入 OmniConsole 自身作为平台。
zh_tw: 無法匯入 OmniConsole 自身作為平台。

# Import_Error_InvalidExecutable
source: Executable path must end with .exe.
zh_cn: 可执行文件路径须以 .exe 结尾。
zh_tw: 執行檔路徑須以 .exe 結尾。

# Import_Error_ConsoleApp
source: Console applications are not supported.
zh_cn: 不支持控制台应用程序。
zh_tw: 不支援主控台應用程式。

# Import_Error_PackageNotAllowed
source: This package cannot be used as a platform (e.g., it may be an extension, service, or runtime component).
zh_cn: 此包无法作为平台使用（例如扩展、后台服务或运行时组件）。
zh_tw: 此套件無法作為平台使用（例如延伸模組、背景服務或執行時期元件）。

# ExportSuccessTeachingTip.Title
source: Copied!
zh_cn: 已复制！
zh_tw: 已複製！

# ExportSuccessTeachingTip.Subtitle
source: Platform configuration copied to clipboard.
zh_cn: 平台配置已复制到剪贴板。
zh_tw: 平台配置已複製到剪貼簿。

# FilePickerDialog_Title
source: Select a file
zh_cn: 选择文件
zh_tw: 選取檔案

# FilePickerDialog_Select
source: Select
zh_cn: 选择
zh_tw: 選取

# FilePickerDialog_EmptyFolder
source: This folder is empty
zh_cn: 此文件夹为空
zh_tw: 此資料夾是空的

# FilePickerDialog_AccessDenied
source: Access denied
zh_cn: 访问被拒绝
zh_tw: 存取被拒

# FilePickerDialog_Desktop
source: Desktop
zh_cn: 桌面
zh_tw: 桌面

# FilePickerDialog_Downloads
source: Downloads
zh_cn: 下载
zh_tw: 下載

# FilePickerDialog_Documents
source: Documents
zh_cn: 文档
zh_tw: 文件

# FilePickerDialog_Pictures
source: Pictures
zh_cn: 图片
zh_tw: 圖片

# FilePickerDialog_Music
source: Music
zh_cn: 音乐
zh_tw: 音樂

# FilePickerDialog_Videos
source: Videos
zh_cn: 视频
zh_tw: 影片

# FilePickerDialog_FilterExe
source: Executables (*.exe)
zh_cn: 可执行文件 (*.exe)
zh_tw: 可執行檔 (*.exe)

# FilePickerDialog_FilterImage
source: Images (*.png, *.jpg, *.jpeg, *.bmp)
zh_cn: 图片 (*.png, *.jpg, *.jpeg, *.bmp)
zh_tw: 圖片 (*.png, *.jpg, *.jpeg, *.bmp)

# FilePickerDialog_NavigateUp
source: Up one level
zh_cn: 上一层
zh_tw: 上一層

# FilePickerDialog_LegacyPicker
source: Browse (Windows)
zh_cn: 浏览 (Windows)
zh_tw: 瀏覽 (Windows)

# AdvancedSection_Updates.Text
source: Updates
zh_cn: 更新
zh_tw: 更新

# AutoUpdateCheck_Title.Text
source: Automatic Update Check
zh_cn: 自动检查更新
zh_tw: 自動檢查更新

# AutoUpdateCheck_Description.Text
source: Check for new versions when opening settings.
zh_cn: 打开设置时自动检查新版本。
zh_tw: 開啟設定時自動檢查新版本。

# VersionInfo_Title.Text
source: Version
zh_cn: 版本
zh_tw: 版本

# CheckForUpdatesButton.Content
source: Check for Updates
zh_cn: 检查更新
zh_tw: 檢查更新

# DownloadInstallButton.Content
source: Download & Install
zh_cn: 下载并安装
zh_tw: 下載並安裝

# UpdateCheck_NewVersion_Subtitle
source: OmniConsoleMod v{0} is available.
zh_cn: OmniConsoleMod v{0} 已可下载。
zh_tw: OmniConsole v{0} 已可下載。

# UpdateCheck_UpToDate_Subtitle
source: OmniConsoleMod is on the latest version.
zh_cn: OmniConsoleMod 当前为最新版本。
zh_tw: OmniConsole 目前為最新版本。

# UpdateCheck_Failed_Subtitle
source: Please check your internet connection and try again.
zh_cn: 请检查网络连接后重试。
zh_tw: 請確認網路連線後再試。

# UpdateAvailable_InfoBar
source: OmniConsoleMod v{0} is available.
zh_cn: OmniConsoleMod v{0} 已可下载。
zh_tw: OmniConsole v{0} 已可下載。

# UpdateAvailable_InfoBar_Launch_GameBar
source: OmniConsoleMod v{0} is available. Open OmniConsole Settings from Game Bar > Library, then go to ☰ > Advanced to download and install.
zh_cn: OmniConsoleMod v{0} 已可下载。从“Game Bar > 库”打开 OmniConsole 设置，前往“☰ > 高级”下载并安装。
zh_tw: OmniConsole v{0} 已可下載。從「Game Bar > 媒體櫃」開啟 OmniConsole 設定，前往「☰ > 進階」下載並安裝。

# UpdateAvailable_InfoBar_Launch_StartMenu
source: OmniConsoleMod v{0} is available. Open OmniConsole Settings from Start > All apps, then go to ☰ > Advanced to download and install.
zh_cn: OmniConsoleMod v{0} 已可下载。从“开始 > 所有应用”打开 OmniConsole 设置，前往“☰ > 高级”下载并安装。
zh_tw: OmniConsole v{0} 已可下載。從「開始 > 所有應用程式」開啟 OmniConsole 設定，前往「☰ > 進階」下載並安裝。

# UpdateAvailable_InfoBar_Settings
source: OmniConsoleMod v{0} is available. Go to ☰ > Advanced to download and install.
zh_cn: OmniConsoleMod v{0} 已可下载。前往“☰ > 高级”下载并安装。
zh_tw: OmniConsole v{0} 已可下載。前往「☰ > 進階」下載並安裝。

# UpdateInfoBar_MissingPhantomLink_Title
source: OmniCharm Widget is available.
zh_cn: OmniCharm 小组件已可安装。
zh_tw: OmniCharm 小工具已可安裝。

# UpdateInfoBar_MissingPhantomLink_Message
source: Quick-access Game Bar widget to toggle OmniConsole features in-game. Go to ☰ > Advanced to download and install.
zh_cn: 在游戏中快速切换 OmniConsole 功能的 Game Bar 小组件。前往“☰ > 高级”下载并安装。
zh_tw: 在遊戲中快速切換 OmniConsole 功能的 Game Bar 小工具。前往「☰ > 進階」下載並安裝。

# UpdateInfoBar_MissingPhantomLink_Launch_GameBar
source: OmniCharm Widget is available. Open OmniConsole Settings from Game Bar > Library, then go to ☰ > Advanced to download and install.
zh_cn: OmniCharm 小组件已可安装。从“Game Bar > 库”打开 OmniConsole 设置，前往“☰ > 高级”下载并安装。
zh_tw: OmniCharm 小工具已可安裝。從「Game Bar > 媒體櫃」開啟 OmniConsole 設定，前往「☰ > 進階」下載並安裝。

# UpdateInfoBar_MissingPhantomLink_Launch_StartMenu
source: OmniCharm Widget is available. Open OmniConsole Settings from Start > All apps, then go to ☰ > Advanced to download and install.
zh_cn: OmniCharm 小组件已可安装。从“开始 > 所有应用”打开 OmniConsole 设置，前往“☰ > 高级”下载并安装。
zh_tw: OmniCharm 小工具已可安裝。從「開始 > 所有應用程式」開啟 OmniConsole 設定，前往「☰ > 進階」下載並安裝。

# UpdateCheck_Checking
source: Checking...
zh_cn: 检查中...
zh_tw: 檢查中...

# UpdateDownload_InProgress
source: Downloading...
zh_cn: 下载中...
zh_tw: 下載中...

# UpdateDownload_Installing
source: Download complete. Installing...
zh_cn: 下载完成，正在安装...
zh_tw: 下載完成，正在安裝...

# UpdateDownload_Failed
source: Download failed. Please try again.
zh_cn: 下载失败，请重试。
zh_tw: 下載失敗，請再試一次。

# UpdateProgressDialog_Title
source: Updating OmniConsoleMod
zh_cn: 正在更新 OmniConsoleMod
zh_tw: 正在更新 OmniConsole

# UpdateProgressDialog_Hint
source: Do not close the app or shut down the console until the update finishes.
zh_cn: 更新完成前，请勿关闭应用或主机。
zh_tw: 請勿關閉應用程式或主機，直到更新完成。

# UpdateProgress_Phase1Download
source: Downloading OmniCharm widget (1 of 2)...
zh_cn: 正在下载 OmniCharm 小组件（1 / 2）...
zh_tw: 正在下載 OmniCharm 小工具（1 / 2）...
